package demo;

public class math7_4 {
	/*
	 * 問題:<誰在說謊>請問誰說的是假話？誰說的是真話？
	 * 現有張三、李四、王五三個人。
	 * 張三說李四在說謊，李四說王五在說謊，王五說張三和李四都在說謊。 
	 */
	
	/*
	 * 假設張三、李四、王五分別為變數Ａ、Ｂ、Ｃ
	 * 說真話等於1、說假話等於0
	 * 張三說李四在說謊:A==1 && B==0，否則A==0 && B==1
	 * 李四說王五在說謊:B==1 && C==0，否則B==0 && C==1
	 * 王五說張三和李四都在說謊:C==1 && A+B==0，否則C==0 && A+B!=0
	 * 滿足上面條件就是答案↓
	 * ((A==1 && B==0 || A==0 && B==1) && (B==1 && C==0 || B==0 && C==1) && (C==1 && A+B==0 || C==0 && A+B!=0))
	 */ 

	public static void main(String[] args) {
		int A, B, C;
		for(A=0; A<=1; A++){
			for(B=0; B<=1; B++){	// 三重迴圈，各種情況
				for(C=0; C <=1; C++){
					// 滿足條件
					if((A==1 && B==0 || A==0 && B==1) && (B==1 && C==0 || B==0 && C==1) && (C==1 && A+B==0 || C==0 && A+B!=0)){
						// 輸出結果
						System.out.println("張三說的是" + (A==1? "真話" : "假話"));
						System.out.println("李四說的是" + (B==1? "真話" : "假話"));
						System.out.println("王五說的是" + (C==1? "真話" : "假話"));
					}
				}
			}
		}

	}

}
